package inflearn._1_simulation;

import java.util.Arrays;

public class 잃어버린_강아지 {
    public static void main(String[] args) {
        잃어버린_강아지 c = new 잃어버린_강아지();
        c.test();
    }

    public void test(){
        int t1 = solution(new int[][] {
                {0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {0, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 1, 0, 0},
                {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 2, 0, 0},
                {1, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
                {0, 0, 0, 0, 0, 3, 0, 0, 0, 1},
                {0, 0, 0, 1, 0, 1, 0, 0, 0, 0},
                {0, 1, 0, 1, 0, 0, 0, 0, 0, 0}
        });
        int t2 = solution(new int[][]{
                        {1, 0, 0, 0, 1, 0, 0, 0, 0, 0},
                        {0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
                        {0, 0, 1, 1, 0, 0, 0, 1, 0, 0},
                        {0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                        {0, 0, 0, 1, 0, 1, 0, 0, 0, 0},
                        {1, 0, 0, 0, 0, 0, 1, 0, 1, 0},
                        {0, 0, 0, 1, 0, 0, 0, 0, 0, 0},
                        {0, 0, 1, 0, 0, 0, 0, 0, 2, 1},
                        {0, 0, 0, 1, 0, 1, 0, 0, 0, 1},
                        {0, 1, 0, 1, 0, 0, 0, 0, 0, 3}
        });

        System.out.println(t1);
        System.out.println(t2);

        assert t1==51
                : t1 + "실패";
        assert t2 == 17
                : t2 + "실패";
    }

    public int solution(int[][] board){
        int result = 0;

        return result;
    }
}


